In [11]:
import pandas as pd
num = 0
for data in  pd.read_csv("employees_202206172332.csv", chunksize = 5000 ):
    num = num+1
    name = 'emps_'+str(num)+'.csv'
    data.to_csv(name, index=False)
    #print(name, 'loaded')

In [29]:
import glob
path = r'D:\Code_Place\Data-Science\PySpark_SparkSql\files' # use your path
filenames = glob.glob(path + "/*.csv")
df = pd.concat(map(pd.read_csv, filenames))
df.head()

   emp_no emp_title_id  birth_date  first_name  last_name gender   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco      M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande      F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb      F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff      M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann      F  1991-01-18

In [30]:
print(len(df))

300024

In [45]:
df['Full Name'] = df['first_name'] +' '+ df['last_name'].map(str)
df = df.drop(['first_name','last_name'], axis=1)
df.head()

   emp_no emp_title_id  birth_date gender   hire_date           Full Name
0  473302        s0001  1953-07-25      M  1990-04-28   Hideyuki Zallocco
1  475053        e0002  1954-11-18      F  1991-09-07     Byong Delgrande
2   57444        e0002  1958-01-30      F  1992-03-21          Berry Babb
3  421786        s0001  1957-09-28      M  1987-11-26      Xiong Verhoeff
4  282238        e0003  1952-10-28      F  1991-01-18  Abdelkader Baumann

In [46]:
names = df.columns.to_list()
names

['emp_no', 'emp_title_id', 'birth_date', 'gender', 'hire_date', 'Full Name']

In [49]:
df = df[['emp_no', 'Full Name', 'gender', 'hire_date']]
df.head()

   emp_no           Full Name gender   hire_date
0  473302   Hideyuki Zallocco      M  1990-04-28
1  475053     Byong Delgrande      F  1991-09-07
2   57444          Berry Babb      F  1992-03-21
3  421786      Xiong Verhoeff      M  1987-11-26
4  282238  Abdelkader Baumann      F  1991-01-18

In [51]:
df.to_json('emp.json', orient='records',indent=4,lines=True)

In [1]:
import findspark
findspark.init()

# Create SparkSession from builder
import pyspark
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local") \
                    .appName('My App') \
                    .getOrCreate()
print(spark)

<pyspark.sql.session.SparkSession object at 0x0000019064F25F70>

In [2]:
sdf = spark.read.csv("employees_202206172332.csv")

sdf.show()

+------+------------+----------+----------+----------+------+----------+
|   _c0|         _c1|       _c2|       _c3|       _c4|   _c5|       _c6|
+------+------------+----------+----------+----------+------+----------+
|emp_no|emp_title_id|birth_date|first_name| last_name|gender| hire_date|
|473302|       s0001|1953-07-25|  Hideyuki|  Zallocco|     M|1990-04-28|
|475053|       e0002|1954-11-18|     Byong| Delgrande|     F|1991-09-07|
| 57444|       e0002|1958-01-30|     Berry|      Babb|     F|1992-03-21|
|421786|       s0001|1957-09-28|     Xiong|  Verhoeff|     M|1987-11-26|
|282238|       e0003|1952-10-28|Abdelkader|   Baumann|     F|1991-01-18|
|263976|       e0003|1959-10-30|      Eran|  Cusworth|     M|1986-11-14|
|273487|       s0001|1957-04-14| Christoph|   Parfitt|     M|1991-06-28|
|461591|       s0002|1964-11-17|    Xudong|  Samarati|     M|1985-11-13|
|477657|       e0002|1962-12-18|    Lihong| Magliocco|     M|1993-10-23|
|219881|       s0002|1956-04-24| Kwangyoen|     Speek|     F|1993-02-14|
| 29920|       e0002|1961-12-31|   Shuichi|     Tyugu|     F|1995-01-17|
|208153|       e0003|1961-10-25|   Abdulah|      Lunn|     M|1989-04-08|
| 13616|       e0003|1961-08-30|     Perry|     Lorho|     F|1991-08-03|
|246449|       s0001|1958-03-23|     Subbu|Bultermann|     F|1988-03-25|
| 21529|       e0002|1959-05-19|     Bojan|  Zallocco|     M|1986-10-14|
| 17934|       e0004|1963-07-12|  Bilhanan|  Wuwongse|     M|1993-10-06|
| 48085|       s0001|1964-01-19|Venkatesan|      Gilg|     M|1993-06-28|
|239838|       e0002|1957-12-11|   Naftali|     Dulli|     M|1993-06-06|
|240129|       e0004|1952-08-11|     Roddy|    Karnin|     M|1985-05-29|
+------+------------+----------+----------+----------+------+----------+
only showing top 20 rows